In [39]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [40]:
df=pd.read_csv('marital status.csv')

In [41]:
df

    age  status
0    21     0.0
1    33     1.0
2    24     0.0
3    28     1.0
4    17     0.0
5    33     1.0
6    23     0.0
7    30     0.0
8    29     1.0
9    22     0.0
10   26     1.0
11   20     0.0
12   22     0.0
13   24     NaN
14   34     1.0
15   29     1.0
16   16     0.0
17   18     0.0
18   26     1.0
19   25     1.0

In [42]:
df.isnull().sum()

age       0
status    1
dtype: int64

In [43]:
df['status'].fillna(df['status'].median(),inplace=True)

In [50]:
df.isnull().sum()

age       0
status    0
dtype: int64

In [51]:
x=df[['age']]

In [60]:
x

    age
0    21
1    33
2    24
3    28
4    17
5    33
6    23
7    30
8    29
9    22
10   26
11   20
12   22
13   24
14   34
15   29
16   16
17   18
18   26
19   25

In [52]:
y=df['status']

In [61]:
y

0     0.0
1     1.0
2     0.0
3     1.0
4     0.0
5     1.0
6     0.0
7     0.0
8     1.0
9     0.0
10    1.0
11    0.0
12    0.0
13    0.0
14    1.0
15    1.0
16    0.0
17    0.0
18    1.0
19    1.0
Name: status, dtype: float64

In [65]:
y.value_counts()

0.0    11
1.0     9
Name: status, dtype: int64

In [66]:
from sklearn.model_selection import train_test_split

In [75]:
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=.30,random_state=1)

In [76]:
from sklearn.linear_model import LogisticRegression

In [77]:
reg=LogisticRegression()

In [78]:
ytrain

4     0.0
17    0.0
7     0.0
1     1.0
13    0.0
0     0.0
19    1.0
18    1.0
9     0.0
15    1.0
8     1.0
12    0.0
11    0.0
5     1.0
Name: status, dtype: float64

In [79]:
reg.fit(xtrain,ytrain)

LogisticRegression()

In [87]:
xtest

    age
3    28
16   16
6    23
10   26
2    24
14   34

In [88]:
ytest

3     1.0
16    0.0
6     0.0
10    1.0
2     0.0
14    1.0
Name: status, dtype: float64

In [80]:
reg.predict(xtest)

array([1., 0., 0., 0., 0., 1.])

In [82]:
reg.score(xtest,ytest)

0.8333333333333334